Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags
The flag for keeping track if object should be hidden.

Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags.ShouldNotBeHidden
Should not be hidden, default value.

Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags.HideFromDrawingView
To be hidden from drawing view.

Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags.HideFromDrawing
To be hidden from drawing.

Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags.ShowInDrawingView
To be shown in drawing view.

Tekla.Structures.Drawing.Hideable.ShouldBeHiddenFlags.ShowInDrawing
To be shown in drawing.